{
  "format": "graph-model",
  "generatedBy": "2.11.0",
  "convertedBy": "TensorFlow.js Converter v4.6.0",
  "signature": {
    "inputs": {
      "input_1": {
        "name": "input_1:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            {
              "size": "-1"
            },
            {
              "size": "180"
            },
            {
              "size": "180"
            },
            {
              "size": "3"
            }
          ]
        }
      }
    },
    "outputs": {
      "outputs": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            {
              "size": "-1"
            },
            {
              "size": "5"
            }
          ]
        }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/sequential_1/rescaling/Cast/x",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {}
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/rescaling/Cast_1/x",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {}
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "16"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "16"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "16"
                  },
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "64"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "64"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "64"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_3/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "64"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "64"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_5/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "64"
                  },
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_5/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/flatten/Const",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/dense/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/dense/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/outputs/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  },
                  {
                    "size": "5"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/outputs/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "5"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "input_1",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "180"
                },
                {
                  "size": "180"
                },
                {
                  "size": "3"
                }
              ]
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/rescaling/mul",
        "op": "Mul",
        "input": [
          "input_1",
          "StatefulPartitionedCall/sequential_1/rescaling/Cast/x"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/rescaling/add",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/sequential_1/rescaling/mul",
          "StatefulPartitionedCall/sequential_1/rescaling/Cast_1/x"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_1/rescaling/add",
          "StatefulPartitionedCall/sequential_1/conv2d/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_1/conv2d/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": {
            "i": "0"
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "filter_format": {
            "s": "SFdJTw=="
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "num_args": {
            "i": "1"
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "TArgs": {
            "list": {
              "type": [
                "DT_FLOAT"
              ]
            }
          },
          "padding": {
            "s": "U0FNRQ=="
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "leakyrelu_alpha": {
            "f": 0.2
          },
          "epsilon": {
            "f": 0.0
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "explicit_paddings": {
            "list": {}
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/max_pooling2d/MaxPool",
        "op": "MaxPool",
        "input": [
          "StatefulPartitionedCall/sequential_1/conv2d/Relu"
        ],
        "attr": {
          "padding": {
            "s": "VkFMSUQ="
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "explicit_paddings": {
            "list": {}
          },
          "ksize": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_1/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_1/max_pooling2d/MaxPool",
          "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": {
            "i": "0"
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "filter_format": {
            "s": "SFdJTw=="
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "num_args": {
            "i": "1"
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "TArgs": {
            "list": {
              "type": [
                "DT_FLOAT"
              ]
            }
          },
          "padding": {
            "s": "U0FNRQ=="
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "leakyrelu_alpha": {
            "f": 0.2
          },
          "epsilon": {
            "f": 0.0
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "explicit_paddings": {
            "list": {}
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool",
        "op": "MaxPool",
        "input": [
          "StatefulPartitionedCall/sequential_1/conv2d_1/Relu"
        ],
        "attr": {
          "padding": {
            "s": "VkFMSUQ="
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "explicit_paddings": {
            "list": {}
          },
          "ksize": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_2/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool",
          "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": {
            "i": "0"
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "filter_format": {
            "s": "SFdJTw=="
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "num_args": {
            "i": "1"
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "TArgs": {
            "list": {
              "type": [
                "DT_FLOAT"
              ]
            }
          },
          "padding": {
            "s": "U0FNRQ=="
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "leakyrelu_alpha": {
            "f": 0.2
          },
          "epsilon": {
            "f": 0.0
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "explicit_paddings": {
            "list": {}
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool",
        "op": "MaxPool",
        "input": [
          "StatefulPartitionedCall/sequential_1/conv2d_2/Relu"
        ],
        "attr": {
          "padding": {
            "s": "VkFMSUQ="
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "explicit_paddings": {
            "list": {}
          },
          "ksize": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_3/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_1/max_pooling2d_2/MaxPool",
          "StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_1/conv2d_3/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": {
            "i": "0"
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "filter_format": {
            "s": "SFdJTw=="
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "num_args": {
            "i": "1"
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "TArgs": {
            "list": {
              "type": [
                "DT_FLOAT"
              ]
            }
          },
          "padding": {
            "s": "U0FNRQ=="
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "leakyrelu_alpha": {
            "f": 0.2
          },
          "epsilon": {
            "f": 0.0
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "explicit_paddings": {
            "list": {}
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/max_pooling2d_3/MaxPool",
        "op": "MaxPool",
        "input": [
          "StatefulPartitionedCall/sequential_1/conv2d_3/Relu"
        ],
        "attr": {
          "ksize": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "explicit_paddings": {
            "list": {}
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_4/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_1/max_pooling2d_3/MaxPool",
          "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": {
            "i": "0"
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "filter_format": {
            "s": "SFdJTw=="
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "num_args": {
            "i": "1"
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "TArgs": {
            "list": {
              "type": [
                "DT_FLOAT"
              ]
            }
          },
          "padding": {
            "s": "U0FNRQ=="
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "leakyrelu_alpha": {
            "f": 0.2
          },
          "epsilon": {
            "f": 0.0
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "explicit_paddings": {
            "list": {}
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/max_pooling2d_4/MaxPool",
        "op": "MaxPool",
        "input": [
          "StatefulPartitionedCall/sequential_1/conv2d_4/Relu"
        ],
        "attr": {
          "ksize": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "explicit_paddings": {
            "list": {}
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/conv2d_5/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_1/max_pooling2d_4/MaxPool",
          "StatefulPartitionedCall/sequential_1/conv2d_5/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_1/conv2d_5/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_host_args": {
            "i": "0"
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "filter_format": {
            "s": "SFdJTw=="
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "num_args": {
            "i": "1"
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "TArgs": {
            "list": {
              "type": [
                "DT_FLOAT"
              ]
            }
          },
          "padding": {
            "s": "U0FNRQ=="
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "leakyrelu_alpha": {
            "f": 0.2
          },
          "epsilon": {
            "f": 0.0
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "explicit_paddings": {
            "list": {}
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/max_pooling2d_5/MaxPool",
        "op": "MaxPool",
        "input": [
          "StatefulPartitionedCall/sequential_1/conv2d_5/Relu"
        ],
        "attr": {
          "ksize": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "explicit_paddings": {
            "list": {}
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/flatten/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/sequential_1/max_pooling2d_5/MaxPool",
          "StatefulPartitionedCall/sequential_1/flatten/Const"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "Tshape": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/dense/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_1/flatten/Reshape",
          "StatefulPartitionedCall/sequential_1/dense/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential_1/dense/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": {
            "b": false
          },
          "transpose_b": {
            "b": false
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "leakyrelu_alpha": {
            "f": 0.2
          },
          "num_args": {
            "i": "1"
          },
          "epsilon": {
            "f": 0.0
          },
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_1/outputs/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_1/dense/Relu",
          "StatefulPartitionedCall/sequential_1/outputs/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential_1/outputs/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": {
            "b": false
          },
          "transpose_b": {
            "b": false
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA=="
              ]
            }
          },
          "num_args": {
            "i": "1"
          },
          "leakyrelu_alpha": {
            "f": 0.2
          },
          "epsilon": {
            "f": 0.0
          },
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": [
          "StatefulPartitionedCall/sequential_1/outputs/BiasAdd"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      }
    ],
    "library": {},
    "versions": {
      "producer": 1395
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "StatefulPartitionedCall/sequential_1/rescaling/Cast/x",
          "shape": [],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/rescaling/Cast_1/x",
          "shape": [],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d/Conv2D/ReadVariableOp",
          "shape": [
            3,
            3,
            3,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d/BiasAdd/ReadVariableOp",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_1/Conv2D/ReadVariableOp",
          "shape": [
            3,
            3,
            16,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_1/BiasAdd/ReadVariableOp",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_2/Conv2D/ReadVariableOp",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_2/BiasAdd/ReadVariableOp",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_3/Conv2D/ReadVariableOp",
          "shape": [
            3,
            3,
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_3/BiasAdd/ReadVariableOp",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/ReadVariableOp",
          "shape": [
            3,
            3,
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/ReadVariableOp",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_5/Conv2D/ReadVariableOp",
          "shape": [
            3,
            3,
            64,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/conv2d_5/BiasAdd/ReadVariableOp",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/flatten/Const",
          "shape": [
            2
          ],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/dense/MatMul/ReadVariableOp",
          "shape": [
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/dense/BiasAdd/ReadVariableOp",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/outputs/MatMul/ReadVariableOp",
          "shape": [
            128,
            5
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_1/outputs/BiasAdd/ReadVariableOp",
          "shape": [
            5
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}